tutorials/rhoDarcyFoam/gravityCurrent/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../AJRParameters"

dimensions      [0 1 -2 0 0 0 0];
/* value           (0 0 -9.81); */
value           (0 0 -1.0);

// value           (#calc "-sin(degToRad($angle))" 0.0 #calc "-cos(degToRad($angle))");




// ************************************************************************* //
