tutorials/rhoDarcyFoam/gravityCurrent/system/setExprFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setExprFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// #include "../AJRParameters"

expressions
(
    T
    {
        field T;
        dimensions [0 0 0 1 0 0 0];

        variables
        (
            "Lx = 15"
            "xini = Lx / 5"
        );

        expression
        #{
            0.5 * (1 - tanh(100*(pos().z() - xini)))
        #};
    }
);